Fix process flow diagram using mermaid, remove unnecessary community links, add LICENSE file
